---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalysisType
source: html/95fb9ccf-29f0-ca97-895b-bd72c717a6f0.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalysisType Property

The type of analysis mode.

## Syntax (C#)
```csharp
public AnalysisMode AnalysisType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The analysis type does not fall within an appropriate range.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration